Repository: papuzz/fast_tenders
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: TenderWin Ethiopia
am: TenderWin ኢትዮጵያ

# welcomeMessage
source: Welcome to TenderWin!
am: ወደ TenderWin እንኳን በደህና መጡ!

source: Welcome Back
am: እንኳን በደህና ተመለሱ

# loginSubtitle
source: Login to access your tenders
am: ጨረታዎችን ለማግኘት ይግቡ

# emailLabel
source: Email
am: ኢሜይል

# phoneLabel
source: Phone Number
am: ስልክ ቁጥር

# usePhone
source: Use Phone Number
am: በስልክ ቁጥር ይጠቀሙ

source: Use Email
am: በኢሜይል ይጠቀሙ

source: Send OTP
am: OTP ላክ

source: Verify OTP
am: OTP አረጋግጥ

# otpLabel
source: OTP Code
am: የማረጋገጫ ኮድ (OTP)

# phoneHint
source: Please enter your phone number
am: እባክዎ ስልክ ቁጥርዎን ያስገቡ

# otpHint
source: Please enter the code sent to your phone
am: እባክዎ ወደ ስልክዎ የተላከውን ኮድ ያስገቡ

# phoneFormatHelper
source: Format: +2519...
am: ቅርጸት: +2519...

# emailHint
source: Please enter your email
am: እባክዎ ኢሜይልዎን ያስገቡ

# passwordLabel
source: Password
am: የይለፍ ቃል

# passwordHint
source: Please enter your password
am: እባክዎ የይለፍ ቃልዎን ያስገቡ

source: Forgot Password?
am: የይለፍ ቃል ረሱ?

# loginButton
source: Login
am: ይግቡ

# noAccount
source: Don't have an account?
am: መለያ የለዎትም?

# signUpButton
source: Sign Up
am: ይመዝገቡ

source: Create Account
am: መለያ ይፍጠሩ

# signUpSubtitle
source: Sign up to start winning tenders
am: ጨረታዎችን ማሸነፍ ለመጀመር ይመዝገቡ

# fullNameLabel
source: Full Name
am: ሙሉ ስም

# fullNameHint
source: Please enter your full name
am: እባክዎ ሙሉ ስምዎን ያስገቡ

# passwordHint2
source: Please enter a password
am: እባክዎ የይለፍ ቃል ያስገቡ

# passwordLengthError
source: Password must be at least 6 characters
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች መሆን አለበት

source: Confirm Password
am: የይለፍ ቃል አረጋግጥ

# passwordMismatch
source: Passwords do not match
am: የይለፍ ቃሎች አይዛመዱም

# accountCreated
source: Account created! Please check your email for confirmation.
am: መለያ ተፈጥሯል! እባክዎ ለማረጋገጥ ኢሜይልዎን ያረጋግጡ።

# alreadyHaveAccount
source: Already have an account?
am: መለያ አለዎት?

# resetPasswordTitle
source: Reset Password
am: የይለፍ ቃል ዳግም አስጀምር

# forgotPasswordTitle
source: Forgot your password?
am: የይለፍ ቃልዎን ረሱ?

# forgotPasswordDesc
source: Enter your email address and we will send you a link to reset your password.
am: ኢሜይልዎን ያስገቡ እና የይለፍ ቃልዎን ዳግም ለማስጀመር አገናኝ እንልክልዎታለን።

source: Send Reset Link
am: የመልሶ ማግኛ አገናኝ ላክ

# resetLinkSent
source: Password reset link sent to your email
am: የይለፍ ቃል ዳግም ማስጀመሪያ አገናኝ ወደ ኢሜይልዎ ተልኳል

# tendersTitle
source: Tenders
am: ጨረታዎች

# searchHint
source: Search tenders / scanned text...
am: ጨረታዎችን ፈልግ / የተቃኘ ጽሑፍ...

# catAll
source: All
am: ሁሉም

# catConstruction
source: Construction
am: ኮንስትራክሽን

# catIT
source: IT & Telecom
am: አይቲ እና ቴሌኮም

# catHealth
source: Health
am: ጤና

# catEnergy
source: Energy
am: ኢነርጂ

# catSupply
source: Supply
am: አቅርቦት

# hoursLeft
source: {count} Hours Left
am: {count} ሰዓታት ቀርተዋል

# daysLeft
source: {count} Days Left
am: {count} ቀናት ቀርተዋል

source: Coming Soon
am: በቅርብ ቀን

# settingsTitle
source: Settings
am: ቅንብሮች

# settingsComingSoon
source: Settings & Profile (Coming Soon)
am: ቅንብሮች እና መገለጫ (በቅርብ ቀን)

source: CPO REQUIRED
am: CPO ያስፈልጋል

source: Share Card
am: ካርዱን አጋራ

source: View Details
am: ዝርዝሮችን ይመልከቱ

# endsInHours
source: Ends in {count}h
am: በ{count} ሰዓታት ውስጥ ያበቃል

# cpoCalcTitle
source: CPO Calculator
am: CPO ማስያ

# cpoCalcDesc
source: Calculate your Bid Bond (CPO) instantly.
am: የጨረታ ማስያዣዎን (CPO) ወዲያውኑ ያስሉ።

source: Total Bid Amount
am: ጠቅላላ የጨረታ መጠን

# bidAmountHelper
source: Enter the total amount of your offer
am: የቅናሽዎን ጠቅላላ መጠን ያስገቡ

# percentageLabel
source: Percentage (%)
am: በመቶኛ (%)

# fixedAmountLabel
source: Fixed Amount
am: የተወሰነ መጠን

source: Percentage
am: በመቶኛ

# generatingCpo
source: Generating CPO Request Letter... (Coming Soon)
am: የ CPO መጠየቂያ ደብዳቤ በማመንጨት ላይ... (በቅርብ ቀን)

# generateCpoLetter
source: Generate Bank CPO Request Letter
am: የባንክ CPO መጠየቂያ ደብዳቤ ይፍጠሩ

# navTenders
source: Tenders
am: ጨረታዎች

# navBrowse
source: Browse
am: መፈለጊያ

# navCpo
source: CPO Calc
am: CPO ማስያ

# navProfile
source: Profile
am: መገለጫ

# postedAgo
source: Posted {time}
am: {time} ተለጠፈ

source: Opening: {date}
am: መክፈቻ: {date}

source: Closing: {date}
am: መዝጊያ: {date}

source: Today
am: ዛሬ

source: Yesterday
am: ትናንት

# daysAgo
source: {count} days ago
am: ከ {count} ቀናት በፊት

source: No tenders found
am: ምንም ጨረታ አልተገኘም

# adjustFilters
source: Try adjusting your search or filters
am: እባክዎ ፍለጋዎን ወይም ማጣሪያዎችን ያስተካክሉ

# drawerAllTenders
source: All Tenders
am: ሁሉም ጨረታዎች

# drawerMyTenders
source: My Tenders
am: የእኔ ጨረታዎች

# drawerFreeTenders
source: Free Tenders
am: ነፃ ጨረታዎች

# drawerSavedTenders
source: Saved Tenders
am: የተቀመጡ ጨረታዎች

# drawerUnread
source: Unread
am: ያልተነበቡ

# drawerTrashed
source: Trashed
am: የተጣሉ

# drawerSettings
source: Settings
am: ቅንብሮች

# drawerAbout
source: About
am: ስለ እኛ

# drawerHelp
source: Help
am: እርዳታ

source: PRO MEMBER
am: ፕሮ አባል

# locationET
source: • Addis Ababa, ET
am: • አዲስ አበባ, ኢትዮጵያ

# walletSection
source: Wallet & Payments
am: የኪስ ቦርሳ እና ክፍያዎች

source: AVAILABLE BALANCE
am: ያለዎት ቀሪ ሂሳብ

source: Top Up
am: ሂሳብ ይሙሉ

source: Preferences
am: ምርጫዎች

# langPreference
source: Language Preference
am: የቋንቋ ምርጫ

source: Industry Alerts
am: የኢንዱስትሪ ማንቂያዎች

source: Select Industries
am: ኢንዱስትሪዎችን ይምረጡ

# chooseSectorsAlerts
source: Choose the sectors you want to receive alerts for. You will be notified when new tenders match these categories.
am: ማንቂያዎችን ማግኘት የሚፈልጉባቸውን ዘርፎች ይምረጡ። አዳዲስ ጨረታዎች ከነዚህ ምድቦች ጋር ሲዛመዱ ማሳወቂያ ይደርስዎታል።

source: Save Changes
am: ለውጦችን አስቀምጥ

source: Alert preferences updated
am: የማንቂያ ምርጫዎች ተዘምነዋል

# errorSavingPreferences
source: Error saving preferences: {error}
am: ምርጫዎችን በማስቀመጥ ላይ ስህተት ተከስቷል፡ {error}

# industries
source: Construction, IT, Logistics
am: ኮንስትራክሽን፣ አይቲ፣ ሎጂስቲክስ

source: Help & Support
am: እርዳታ እና ድጋፍ

# ocrScanningTitle
source: How to use OCR Scanning
am: የ OCR ቅኝትን እንዴት መጠቀም እንደሚቻል

# ocrScanningDesc
source: Convert paper tenders to digital data instantly.
am: የወረቀት ጨረታዎችን ወዲያውኑ ወደ ዲጂታል መረጃ ይቀይሩ።

# faq
source: Frequently Asked Questions
am: ተደጋጋሚ ጥያቄዎች

# contactSupport
source: Contact Customer Support
am: የደንበኞች ድጋፍን ያግኙ

# logout
source: Logout Account
am: ከመለያ ይውጡ

source: Membership Plan
am: የአባልነት ዕቅድ

source: CURRENT STATUS
am: የአሁኑ ሁኔታ

source: Annual Premium Access
am: የዓመታዊ ፕሪሚየም መዳረሻ

# validUntil
source: Valid until {date}
am: እስከ {date} ድረስ ያገለግላል

source: Upgrade or Change Plan
am: ዕቅድን ያሻሽሉ ወይም ይቀይሩ

source: Update Business Profile
am: የንግድ መገለጫን ያዘምኑ

# updateBusinessProfileSubtitle
source: Refine your preferences and matches
am: ምርጫዎችዎን እና ተዛማጆችን ያስተካክሉ

# teamManagementSubtitle
source: Manage corporate access
am: የድርጅት መዳረሻን ያስተዳድሩ

source: No sectors selected
am: ምንም ዘርፎች አልተመረጡም

source: Loading...
am: በመጫን ላይ...

# catConsultancy
source: Consultancy
am: የምክር አገልግሎት

# catNonConsultancy
source: Non-Consultancy
am: ከምክር ውጭ አገልግሎት

# catAgriculture
source: Agriculture
am: እርሻ

# catEducation
source: Education
am: ትምህርት

# catFinance
source: Finance & Insurance
am: ፋይናንስ እና መድህን

# catTransport
source: Transport
am: ትራንስፖርት

# catManufacturing
source: Manufacturing
am: ማኑፋክቸሪንግ

# catHotel
source: Hotel & Services
am: ሆቴል እና አገልግሎቶች

# catCleaning
source: Cleaning & Security
am: ጽዳት እና ጥበቃ

source: Supplier
am: አቅራቢ

source: Contractor
am: ተቋራጭ

source: Consultant
am: አማካሪ

source: General Trading
am: ጠቅላላ ንግድ

source: Service
am: አገልግሎት

# grade
source: Grade {grade}
am: ደረጃ {grade}

source: N/A
am: አይመለከትም

source: Ministries
am: ሚኒስቴር መስሪያ ቤቶች

source: Universities
am: ዩኒቨርሲቲዎች

source: NGOs
am: መንግስታዊ ያልሆኑ ድርጅቶች (NGOs)

source: SOEs
am: የመንግስት የልማት ድርጅቶች

source: Addis Ababa
am: አዲስ አበባ

source: Oromia
am: ኦሮሚያ

source: Amhara
am: አማራ

source: Nationwide
am: ሀገር አቀፍ

# profileSetupTitle
source: Setup Profile
am: መገለጫ አዋቅር

source: Skip
am: ዝለል

# profileUpdatedSyncing
source: Profile Updated! Your feed is syncing...
am: መገለጫ ተዘምኗል! የእርስዎ ዝርዝር እየተመሳሰለ ነው...

# profileUpdateError
source: Error updating profile: {error}
am: መገለጫ በማዘመን ላይ ስህተት፡ {error}

source: Back
am: ተመለስ

source: Next
am: ቀጣይ

source: Finish
am: ጨርስ

# businessBasicsTitle
source: Business Basics
am: የንግድ መሠረታዊ ነገሮች

# businessBasicsSubtitle
source: Tell us about your company so we can find the right tenders.
am: ትክክለኛውን ጨረታ እንድናገኝልዎ ስለ ድርጅትዎ ይንገሩን።

# businessNameLabel
source: Business Name
am: የንግድ ስም

# businessNameHint
source: e.g., Ethio Tech Solutions
am: ለምሳሌ፡ ኢትዮ ቴክ ሶሉሽንስ

# businessTypeLabel
source: Business Type
am: የንግድ ዓይነት

# primarySectorLabel
source: Primary Sector (Select all that apply)
am: ዋና ዘርፍ (ሁሉንም የሚመለከታቸውን ይምረጡ)

# primarySectorSubtitle
source: We use this to recommend tenders you can actually win.
am: ይህንን የምንጠቀመው ማሸነፍ የሚችሉትን ጨረታ ለመምከር ነው።

# legalLicenseTitle
source: Legal & License Info
am: የህግ እና ፈቃድ መረጃ

# legalLicenseSubtitle
source: Help us verify your eligibility.
am: ብቁነትዎን ለማረጋገጥ ያግዙን።

# tradeLicenseCategoryLabel
source: Trade License Category
am: የንግድ ፈቃድ ምድብ

# licenseGradeLabel
source: License Grade (if applicable)
am: የፈቃድ ደረጃ (የሚመለከተው ከሆነ)

# vatRegisteredLabel
source: VAT Registered?
am: ተጨማሪ እሴት ታክስ ተመዝጋቢ?

source: Yes
am: አዎ

source: No
am: አይ

# taxComplianceDeclaration
source: I declare my tax compliance status is up to date.
am: የግብር ተገዢነት ሁኔታዬ ወቅታዊ መሆኑን አረጋግጣለሁ።

# taxComplianceSubtitle
source: Trust-based declaration.
am: በእምነት ላይ የተመሰረተ መግለጫ።

# targetInstitutionsTitle
source: Target Institutions & Regions
am: የታለመላቸው ተቋማት እና ክልሎች

# targetInstitutionsSubtitle
source: Hyper-relevant notifications, less spam.
am: በጣም ጠቃሚ ማሳወቂያዎች፣ ያነሰ አይፈለጌ መልዕክት።

# preferredInstitutionsLabel
source: Preferred Institutions
am: ተመራጭ ተቋማት

# operatingRegionsLabel
source: Operating Regions
am: የስራ ክልሎች

# alertPreferencesTitle
source: Alert Preferences
am: የማንቂያ ምርጫዎች

# alertPreferencesSubtitle
source: Let users control noise early.
am: ተጠቃሚዎች ድምጽን ቀድመው እንዲቆጣጠሩ ያድርጉ።

# alertMatchingTender
source: Matching tender published
am: ተዛማጅ ጨረታ ታትሟል

# alertMatchingTenderSubtitle
source: Notify me when a tender matches my profile
am: ጨረታ ከመገለጫዬ ጋር ሲዛመድ አሳውቀኝ

# alertFavoriteInstitution
source: Favorite institution posts
am: ተወዳጅ ተቋም ልጥፎች

# alertFavoriteInstitutionSubtitle
source: Notify me when my preferred institutions post
am: የምርጫ ተቋሞቼ ሲለጥፉ አሳውቀኝ

# alertDeadlineApproaching
source: Deadline approaching
am: የማብቂያ ቀን እየቀረበ ነው

# alertDeadlineApproachingSubtitle
source: Notify me 48h before deadline
am: ከማብቂያው 48 ሰዓት በፊት አሳውቀኝ

# alertCompetitorWins
source: Competitor wins
am: ተወዳዳሪ አሸንፏል

# alertCompetitorWinsSubtitle
source: Notify me when a competitor wins a similar tender
am: ተወዳዳሪ ተመሳሳይ ጨረታ ሲያሸንፍ አሳውቀኝ

# profileReadyToSyncTitle
source: Profile Ready to Sync
am: መገለጫ ለማመሳሰል ዝግጁ ነው

# profileReadyToSyncSubtitle
source: Your preferences will be used to filter and recommend tenders.
am: ምርጫዎችዎ ጨረታዎችን ለማጣራት እና ለመምከር ያገለግላሉ።

source: Personalized tender feed
am: የተበጀ የጨረታ ዝርዝር

source: Customized alerts
am: የተበጁ ማንቂያዎች

source: Sector-specific matching
am: ዘርፍ-ተኮር ማዛመድ

source: Configuration Status: Complete
am: የማዋቀር ሁኔታ፡ ተጠናቅቋል

# saveAndUpdateFeed
source: Save & Update My Feed
am: አስቀምጥ እና ዝርዝሬን አዘምን

# previewMatchesLabel
source: Preview of matches for your sectors:
am: ለዘርፍዎ ተዛማጅ ቅድመ እይታ፡

# previewTenderTitle
source: Office Supplies Procurement
am: የቢሮ ዕቃዎች ግዥ

# previewTenderSubtitle
source: Ministry of Education • 2 Days left
am: ትምህርት ሚኒስቴር • 2 ቀናት ቀርተዋል

source: Filter by Category
am: በምድብ አጣራ

source: Reset
am: ዳግም አስጀምር

source: Clear All Filters
am: ሁሉንም ማጣሪያዎች አጽዳ

source: Failed to load tenders
am: ጨረታዎችን መጫን አልተቻለም

source: Retry
am: እንደገና ይሞክሩ

source: Tender bookmark updated
am: የጨረታ ዕልባት ተዘምኗል

# errorWithCount
source: Error: {error}
am: ስህተት፡ {error}

# summaryTitle
source: Summary
am: ማጠቃለያ

# organizationLabel
source: Organization
am: ድርጅት

# projectLabel
source: Project
am: ፕሮጀክት

# deadlineLabel
source: Deadline
am: የማብቂያ ቀን

# bidBondLabel
source: Bid Bond
am: የጨረታ ማስያዣ

source: Not specified
am: አልተገለጸም

# eligibilityLabel
source: Eligibility
am: ብቁነት

source: Unknown
am: ያልታወቀ

# descriptionTitle
source: Description
am: መግለጫ

# noDescriptionAvailable
source: No description available for this tender.
am: ለዚህ ጨረታ ምንም መግለጫ የለም።

source: Historical Winning Prices
am: ታሪካዊ የማሸነፊያ ዋጋዎች

# unlockMarketInsights
source: Unlock market insights for similar tenders
am: ለተመሳሳይ ጨረታዎች የገበያ ግንዛቤዎችን ይክፈቱ

source: Saved
am: ተቀምጧል

source: Save
am: አስቀምጥ

# alertsSetForTender
source: Alerts set for this tender
am: ለዚህ ጨረታ ማንቂያዎች ተዘጋጅተዋል

source: Alerts disabled
am: ማንቂያዎች ተሰናክለዋል

# pleaseLoginToSeeSaved
source: Please login to see saved tenders
am: የተቀመጡ ጨረታዎችን ለማየት እባክዎ ይግቡ

source: No saved tenders yet
am: እስካሁን ምንም የተቀመጠ ጨረታ የለም

# noItemsIn
source: No items in {title}
am: በ{title} ውስጥ ምንም ንጥል የለም

# aiSummaryTitle
source: AI Summary
am: የ AI ማጠቃለያ

source: Generate Summary
am: ማጠቃለያ አመንጭ

# generatingSummary
source: Generating...
am: በማመንጨት ላይ...

# aiSummaryDisclaimer
source: AI-generated summary. Please refer to official documents for final details.
am: በ AI የተመነጨ ማጠቃለያ። እባክዎ ለተሟላ ዝርዝር ኦፊሴላዊ ሰነዶችን ይመልከቱ።

# aiSummaryError
source: Failed to generate summary.
am: ማጠቃለያውን ማመንጨት አልተቻለም።

source: ACTIVE PLAN
am: ንቁ ዕቅድ

source: ACTIVE
am: ንቁ

source: Seat Allocation
am: የመቀመጫ ድልድል

source: Used
am: ጥቅም ላይ የዋለ

# renewsOn
source: Renews on {date}
am: በ{date} ይታደሳል

source: Upgrade or Renew
am: ያሻሽሉ ወይም ያድሱ

source: Team Members
am: የቡድን አባላት

# manageAccessSlots
source: Manage access for your {count} corporate slots
am: ለ{count} የድርጅት ቦታዎችዎ መዳረሻን ያስተዳድሩ

# slotAvailable
source: Slot {count}: Available
am: ቦታ {count}፡ ክፍት ነው

# inviteViaEmailPhone
source: Invite via email or phone number
am: በኢሜይል ወይም በስልክ ቁጥር ይጋብዙ

# emailPhoneHint
source: Email or +251...
am: ኢሜይል ወይም +251...

# inviteSentTo
source: Invite sent to {text}
am: ግብዣ ወደ {text} ተልኳል

# enterEmailPhoneError
source: Please enter an email or phone number
am: እባክዎ ኢሜይል ወይም ስልክ ቁጥር ያስገቡ

source: Invite
am: ጋብዝ

source: Email
am: ኢሜይል

# phoneWithPrefix
source: Phone (+251)
am: ስልክ (+251)

# inviteThirdMember
source: Invite a third team member
am: ሶስተኛ የቡድን አባል ይጋብዙ

source: Add
am: ጨምር

# slot3Config
source: Slot 3 configuration
am: የቦታ 3 ውቅር

source: PENDING STATUS
am: በጥበቃ ላይ ያለ ሁኔታ

source: Invite pending
am: ግብዣ በጥበቃ ላይ

source: Invitation resent
am: ግብዣው እንደገና ተልኳል

source: Resend
am: እንደገና ላክ

source: Invitation cancelled
am: ግብዣው ተሰርዟል

source: Cancel
am: ሰርዝ

source: Collaborative Tendering
am: የትብብር ጨረታ

# collaborativeTenderingDesc
source: Team members share your corporate OCR quota (500 pages/mo) and can contribute to tender bidding analysis in real-time.
am: የቡድን አባላት የእርስዎን የድርጅት OCR ኮታ (በወር 500 ገጾች) ይጋራሉ እና በእውነተኛ ጊዜ ለጨረታ ተሳትፎ አስተዋፅኦ ማድረግ ይችላሉ።

source: ETHIOPIAN MARKET ENTERPRISE
am: የኢትዮጵያ ገበያ ድርጅት

# teamManagementTitle
source: Team Management
am: የቡድን አስተዳደር

source: Membership
am: አባልነት

source: Corporate
am: ድርጅታዊ

source: Personal
am: ግል

# pricePerYear
source: {price} ETB / year
am: {price} ብር / በዓመት

# pricePer6Mo
source: {price} ETB / 6 mo
am: {price} ብር / ለ6 ወር

# pricePer3Mo
source: {price} ETB / 3 mo
am: {price} ብር / ለ3 ወር

# oneYearPremiumAccess
source: 1 Year Premium Access
am: የ1 ዓመት ፕሪሚየም መዳረሻ

source: Best Value
am: ምርጥ ዋጋ

source: Real-time Alerts
am: የእውነተኛ ጊዜ ማንቂያዎች

# sixMonthsPro
source: 6 Months Pro
am: የ6 ወራት ፕሮ

# threeMonthsBasic
source: 3 Months Basic
am: የ3 ወራት መሠረታዊ

source: Enterprise Annual
am: የድርጅት ዓመታዊ

# threeUserLicenses
source: 3 User Licenses
am: የ3 ተጠቃሚዎች ፈቃድ

source: Multi-user Dashboard
am: የብዙ ተጠቃሚዎች ዳሽቦርድ

source: Business 6 Month
am: ቢዝነስ 6 ወር

source: Business Quarterly
am: ቢዝነስ በየሶስት ወሩ

source: Pay with Telebirr / Chapa
am: በቴሌብር / ቻፓ ይክፈሉ

# subscriptionTerms
source: By subscribing, you agree to our Terms of Service. Secure encrypted payment processing.
am: በመመዝገብዎ በአገልግሎት ውላችን ይስማማሉ። ደህንነቱ የተጠበቀ ክፍያ።

source: Complete Payment
am: ክፍያውን ያጠናቅቁ

# userNotLoggedIn
source: User not logged in. Please log in to continue.
am: ተጠቃሚ አልገባም። ለመቀጠል እባክዎ ይግቡ።

source: Redirecting to Chapa...
am: ወደ ቻፓ በማዛወር ላይ...

# couldNotLaunchPayment
source: Could not launch payment URL
am: የክፍያ አገናኙን መክፈት አልተቻለም

source: Pay Now with Chapa
am: አሁን በቻፓ ይክፈሉ

source: Payment Successful!
am: ክፍያው ተሳክቷል!

# subscriptionActivated
source: Your subscription has been activated. You can now access all premium features.
am: አባልነትዎ ነቅቷል። አሁን ሁሉንም የፕሪሚየም አገልግሎቶች ማግኘት ይችላሉ።

source: Go to Dashboard
am: ወደ ዳሽቦርድ ይሂዱ
